---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode.AllDevices
enum: Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode
source: html/ee98a836-6a40-db03-ef1e-655424d04a9a.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode.AllDevices

The circuit path connects to all the devices in the circuits, this mode is compatible to the legacy behavior.